---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IExternalDBApplication
source: html/7e0759de-827c-e115-e8ff-2565ffcc1114.htm
---
# IExternalDBApplication Members

Implement this method to execute some tasks when Autodesk Revit shuts down.